/**
 *
 * @author linsen
 *
 */
class RandomName {


	// public surnameList: string[] = ["司马", "欧阳", "端木", "上官", "独孤", "夏侯", "尉迟", "赫连", "皇甫", "公孙", "慕容", "长孙", "宇文",
	// 	"司徒", "轩辕", "百里", "呼延", "令狐", "诸葛", "南宫", "东方", "西门", "神", "李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周",
	// 	"胡", "林", "梁", "宋", "郑", "唐", "冯", "董", "程", "曹", "袁", "许", "沈", "曾", "彭", "吕", "蒋", "蔡", "魏", "叶", "杜", "夏",
	// 	"汪", "田", "方", "石", "熊", "白", "秦", "江", "孟", "龙", "万", "段", "雷", "武", "乔", "洪", "鲁", "葛", "柳", "岳", "梅", "辛",
	// 	"耿", "关", "苗", "童", "项", "裴", "鲍", "霍", "甘", "景", "包", "柯", "阮", "华", "滕", "穆", "燕", "敖", "冷", "卓", "花", "蓝",
	// 	"楚", "荆"];

	// public man_0: string[] = ["峰", "不", "近", "小", "千", "万", "百", "一", "求", "笑", "双", "凌", "伯", "仲", "叔", "震", "飞", "晓",
	// 	"昌", "霸", "冲", "志", "留", "九", "子", "立", "小", "云", "文", "安", "博", "才", "光", "弘", "华", "清", "灿", "俊", "凯", "乐",
	// 	"良", "明", "健", "辉", "天", "星", "永", "玉", "英", "真", "修", "义", "雪", "嘉", "成", "傲", "欣", "逸", "飘", "凌", "青", "火",
	// 	"森", "杰", "思", "智", "辰", "元", "夕", "苍", "劲", "巨", "潇", "紫", "邪", "尘"];
	// public man_1: string[] = ["败", "悔", "南", "宝", "仞", "刀", "斐", "德", "云", "天", "仁", "岳", "宵", "忌", "爵", "权", "敏", "阳",
	// 	"狂", "冠", "康", "平", "香", "刚", "强", "凡", "邦", "福", "歌", "国", "和", "康", "澜", "民", "宁", "然", "顺", "翔", "晏", "宜",
	// 	"怡", "易", "志", "雄", "佑", "斌", "河", "元", "墨", "松", "林", "之", "翔", "竹", "宇", "轩", "荣", "哲", "风", "霜", "山", "炎",
	// 	"罡", "盛", "睿", "达", "洪", "武", "耀", "磊", "寒", "冰", "潇", "痕", "岚", "空"];

	// public woman_0: string[] = ["思", "冰", "夜", "痴", "依", "小", "香", "绿", "向", "映", "含", "曼", "春", "醉", "之", "新", "雨", "天",
	// 	"如", "若", "涵", "亦", "采", "冬", "安", "芷", "绮", "雅", "飞", "又", "寒", "忆", "晓", "乐", "笑", "妙", "元", "碧", "翠", "初",
	// 	"怀", "幻", "慕", "秋", "语", "觅", "幼", "灵", "傲", "冷", "沛", "念", "寻", "水", "紫", "易", "惜", "诗", "荣", "青", "雁", "盼",
	// 	"尔", "以", "雪", "夏", "凝", "丹", "迎", "问", "宛", "梦", "怜", "听", "巧", "凡", "静"];
	// public woman_1: string[] = ["烟", "琴", "蓝", "梦", "丹", "柳", "冬", "萍", "菱", "寒", "阳", "霜", "白", "丝", "南", "真", "露", "云",
	// 	"芙", "筠", "容", "香", "荷", "风", "儿", "雪", "巧", "蕾", "芹", "柔", "灵", "卉", "夏", "岚", "蓉", "萱", "珍", "彤", "蕊", "曼",
	// 	"凡", "兰", "晴", "珊", "易", "青", "春", "玉", "瑶", "文", "双", "竹", "凝", "桃", "菡", "绿", "枫", "梅", "旋", "山", "松", "之",
	// 	"亦", "蝶", "莲", "柏", "波", "安", "天", "薇", "海", "翠", "槐", "秋", "雁", "夜"];

	// public firstNameArr: string[] = ["温柔", "墨染", "永恒", "无奈", "依然", "流氓", "浪漫", "低调", "曾经", "明月", "等待", "爱上", "传说",
	// 	"自由", "寂寞", "阳光", "蓝色", "逍遥", "美丽", "孤独", "快乐", "天涯", "随风", "疯狂", "神圣", "伤心", "堕落", "红尘", "淡淡", "东方", "月光",
	// 	"失落", "彼岸", "天上", "酱油", "PK", "永远", "愤怒", "海绵", "绝望", "传奇", "神一样", "黑暗", "爱上你", "文盲", "香槟", "自然", "贵族", "路过",
	// 	"骨灰级", "失忆", "浮夸", "时光", "钢铁", "愤怒", "我爱", "天天", "非凡", "飞扬", "咆哮", "完美", "暧昧", "叼烟", "狂暴", "多情", "寂寞", "淘气",
	// 	"奇怪", "纯洁", "搁浅", "岁月", "悲伤", "非常", "花落", "月夜",
	// 	"暮色", "倾城", "焚焰", "龙武", "繁华", "红尘", "暧晗", "梦回", "墨城", "旧人", "陌上", "花落", "夏雨", "栀璃", "寂若", "苍笙"];
	// public secondNameArr: string[] = ["马甲", "男人", "女人", "天空", "世界", "的幸福", "用户名", "的小鱼", "绅士", "的马甲", "的阳光",
	// 	"的灵魂", "的影子", "感觉", "的味道", "的忧伤", "的叶子", "的猪头", "的公主", "的王子", "的春晓", "的仲夏", "的深秋",
	// 	"的寒冬", "宝宝", "守望者", "小丸子", "路人甲", "的翅膀", "的寂寞", "的天使", "爱琴海", "凹凸曼", "的小白", "的声音", "快乐",
	// 	"的心", "的猪", "的错", "的感觉", "的泪", "爱情", "永恒", "苹果", "心情", "的风", "上帝", "欧巴", "静静", "萝莉", "套套", "辉煌", "蛋定", "神明",
	// 	"思密达", "生活", "天堂", "童话", "人生", "新手", "泡沫", "阳光", "幸福", "丫头", "天空", "石头", "月亮", "公子", "镇魂曲", "雅蠛蝶", "可乐",
	// 	"水晶", "灵魂", "梦想", "记忆", "女孩", "无痕", "乖乖", "猫猫", "浪子", "回忆", "流星", "卡卡", "毛毛", "上帝", "兔子", "一刀", "骑士", "心碎",
	// 	"笨笨", "蚂蚁", "菊花", "天下", "大王", "战狼",
	// 	"初晴", "依依", "旋律", "箫歌", "南山", "河山", "风雨", "烟柳", "殇", "浅吟", "烟雨", "谨年", "青笙"];

	public firstName = ["无惧的", "无畏的", "冰封", "死神", "月魔", "元素", "破梦", "天空", "西蒙", "蓝颜", "方向", "翱翔", "庄严",
		"红尘", "埋葬", "神奇的", "冰冷", "判罚者", "初学者", "耐心的", "胆小的", "洒脱", "飞燕", "从容", "宿命", "漂流", "征服", "炽热",
		"沉沦", "搁浅", "浮夸", "仲裁", "千叶", "一生", "说服者", "正义", "炽天使", "第六天", "无边者", "飞翔", "徒劳", "懦弱", "耐心",
		"小丑", "大主教", "唯一的", "黑暗", "耐心", "血染", "风怒", "爱笑", "闪电", "灾难", "炙热", "幻想", "奇迹", "大领主", "首领",
		"勇敢", "坚硬", "孤独", "无边者", "无垢者", "烈阳", "浓烈", "美丽", "可爱", "女王蜂", "领导者", "猎杀者", "驯龙者", "无眠者",
		"自信的", "啰嗦", "智慧", "老迈", "深海", "燃烧", "虔诚", "大财团", "小丑", "免疫", "奔驰的", "交接", "皎洁", "高大", "害羞",
		"致命", "害羞", "天空", "吞噬者", "觉醒者", "追踪者", "代理人", "微笑", "粉碎者", "银河", "双子星", "守护者", "诅咒", "因陀罗",
		"无谋者", "梦幻", "拖刀者", "说服者", "代行者", "潜入者", "监视者", "毁灭者", "螺旋", "掠夺者", "咸鱼哥", "浩瀚", "太阳神", "轰隆",
		"探索者", "裂变", "厄运", "一生", "奢侈", "浮梦", "千城", "洒脱", "聚变", "匆匆", "迷失", "宿命", "漂流", "无双", "魔神", "问情",
		"敷衍", "孪生", "往事", "凌乱", "五国", "甲贺", "忍龙", "雕龙", "一马", "宝宝", "列侬", "深邃", "苦海", "苍白", "腐朽", "万宗",
		"砂砾", "路口", "浮夸", "疯子", "释怀", "流浪", "琉璃", "烟火", "三体", "唯一", "残缺", "灰烬", "回旋", "誓言", "流水", "花落",
		"轻舞", "霞雾", "晚霞", "霓虹", "枷锁", "阴霾", "沉迷", "迁就", "回忆", "声色", "空城", "白云", "逆夏", "达尔", "模糊", "开心",
		"光年", "契约", "森林", "彩色", "星星", "猎豹", "延续", "画心", "着迷", "凝目", "极光", "剑海", "未来", "旅途", "掠过", "舍得",
		"半生", "斑驳", "华光", "梦魇", "蔚蓝", "残留", "主宰", "天地", "樱花", "金兰", "海棠", "定心", "忧深", "神海", "断点", "心淡",
		"怪咖", "未尽", "纠结", "未尽", "习惯", "放肆", "方向", "默然", "翱翔", "尘封", "续写", "碧落", "皇权", "黄泉", "青丝", "神",
		"我", "无", "穷", "鬼", "魔", "绝", "水", "火", "封", "风", "剑", "龙", "元", "圣", "拉达曼", "黑海", "噩梦", "战神", "多闻", "新一", "久久",
	];

	public secondName = ["あ", "#", "︽", "围", "茡", "ビ", "乜", "＼", "㈤", "ネ", "＊", "〒", "〗", "︾", "〒", "★", "☆", "※",
		"⑧", "う", "囚", "嗳", "◇", "▲", "を", "〇", "℅", "づ", "↓", "↙", "￥", "廴", "凹", "凸", "冂", "◆", "♀", "♂", "、", "。",
		"÷", "0", "！", "·", "卐", "々", "∏", "●", "☆", "Ю", "ヱ", "╬", "サ", "℉", "卟", "=", "Δ", "√", "⊕", "ぬ", "ケ", "モ", "虍",
		"ロ", "之", "Ψ", "∑", "リ", "丄", "%", "※", "ぺ", "≡", "Ω", "③", "︾", "卝", "唯*", "亽", "Д", "▕", "惢", "♀", "♂", "ぷ",
		"ⅷ", "Ｑ", "Ф", "〓", "⊙", "ビ", "卟", "の", "＆", "皕", "ジ", "◎", "∴", "∞", "--", "+", "OO", "ж", "π", "①", "_°", "ヾ", "￥"
	];

	public thirdName = ["黑魂", "刺心", "零落", "蓝颜", "不破", "孤影", "浮沉", "妖娆", "圣歌", "晨曦", "女神", "霞破", "精英", "精锐",
		"擒拿", "一线", "断情", "猫猫", "渲染", "血清", "阴霾", "诠释", "尘世", "素颜", "怪咖", "苦口", "旧梦", "亦难", "迦叶", "送葬", "完美",
		"潮流", "白", "囚", "禁", "厌", "冷", "毁", "灭", "宅", "尘", "欲", "信", "傲", "负荷", "天空", "如此", "优柔", "迷途", "黎明", "沧海",
		"耳蜗", "残骸", "默写", "沙漏", "花梨", "葬歌", "冥冥", "猎鹰", "九天", "灭霸", "雷暴", "幽灵", "雷霆", "刺刀", "白虎", "青龙", "朱雀",
		"玄武", "鱼儿", "泪痕", "饕餮", "圣月", "天狼", "葬花", "圣殿", "残月", "赤兔", "独醉", "赤虎", "借口", "一线", "堪阳", "不见", "凌迟",
		"背叛", "鉽探", "魅眸", "畵窗", "游灵", "释然", "幕刃", "瑾色", "呢喃", "肆意", "似我", "炙雪", "逐月", "灵瞳", "冷瞳", "沉世", "蔷薇",
		"讴歌", "琴瑟", "儿", "荒芜", "離殇", "初见", "夏末", "断桥", "玄桥", "沉淀", "怒煞", "烟花", "情歌", "暖阳", "王", "赤", "冷", "诛",
		"紫霞", "灭", "卌", "蚀", "囚", "心", "绛紫", "靛蓝", "墨绿", "风声", "青衣", "负荷", "撕裂", "晓梦", "时光", "荏苒", "荼蘼", "刺魂",
		"月色", "青奴", "轮回", "亡灵", "清澈", "茉莉", "浅岛", "孽缘", "咫尺", "妃红", "绯红", "死囚", "寸断", "方圆", "蒙蔽", "萌萌", "离心",
		"安然", "亟合", "瞳眸", "千寻", "黎明", "夕阳", "残阳", "光芒", "消逝", "伯仲", "杰克", "魔都", "未央", "轮回", "璎珞", "宁珂", "花颜",
		"天沙", "甜心", "侵袭", "孽", "断弦", "葬薆", "葵花", "羁绊", "歔沩", "北岛", "西京", "倒戈", "蓦然", "残颜", "冒险", "雅泽", "恍惚", "痴迷",
		"七年", "泪珠", "荒芜", "时光", "魅力", "堪", "余辉", "定一", "红尘", "缥缈", "神龛", "洞察", "无念", "流年", "岁月", "雅苑", "辗转", "沧澜",
		"空罐", "愫暮", "亦难", "零落", "引魂", "阙反", "静候", "戒律", "极乐", "光速", "英利", "莫西", "仲裁", "恨天", "高深", "天龙", "撒旦", "游离",
		"冈", "困惑", "主宰", "深海", "银河", "漫游", "哈雷", "不闻", "耳语", "喧闹", "天才", "鬼才", "雷神", "王牌", "丝丝", "宝贝", "天使", "山丘",
		"魍魉", "魑魅", "安逸", "洞天", "不败", "新一", "一休", "命门", "八极", "穷极", "黑洞", "深渊", "剑海", "骑士", "团长", "烙印", "十字", "圣手",
		"枫蓝", "天骄", "皇者", "允诺", "星辰", "苍洱", "龙鳞", "碧蓝", "冥途", "狂风", "暴雨", "演奏", "万杀", "万念", "归一", "权重", "祭司", "神父",
		"螺旋", "毗湿奴", "月神", "佯攻", "无邪", "莫离", "元初", "离冥", "珈蓝", "楼兰", "绿洲", "沙漠", "沉剑", "勿念", "四方", "八方", "小学生",
		"冥王", "海王", "天王", "天翼", "战狂", "过客", "晚霞", "顶天", "光宇", "华夏", "炎黄",];

	public specialNameArr: string[] = ["一刀流", "阿斯顿马丁", "哈利波特", "魑魅魍魉", "蓝天白云", "只如初见", "幸福生活", "索马里群星", "君临天下",
		"灯火阑珊", "随便看看", "似水年华", "就是快乐", "PK打架爽", "十步一人", "小桥流水", "浮生若梦", "醉生梦死", "群星之怒", "云淡风清", "新不了情",
		"提拉米苏", "爱新觉罗", "浪迹天涯", "怒斩一方", "炼狱之炎", "一生一世", "卡布奇诺", "上善若水", "普罗旺斯", "烽火连天", "宅男的左手",
		"一棵小葱葱", "裸奔的带子", "谁在乎黑白", "小心点走路", "魔法新达人", "回忆的沙漏", "结婚综合症", "最后一场雪", "猫和老鼠", "易碎水瓶座",
		"天天换床睡", "叼着烟吻你", "嘟是我滴错", "裤裆里放屁", "西街的日月", "小兔吃蘑菇", "大饼想油条", "强力找抽", "玩乃in北京",
		"奥黛利赫本", "自幼爱打针", "懒鱼爱吃猫", "超级上上签", "欲望决定人生", "贫道想要出家", "奥特曼的哥们", "老衲法眼己开",
		"我就一个人", "全部不许动", "十万个尸王", "不是独自一人", "春哥无敌", "硬又黑", "酷似刘德华", "我哥黄晓明", "胖大海", "雄赳赳气昂昂",
		"爱是一种天意", "自挂东南枝", "爱只是个错觉", "香水真的有毒", "春运好难买票", "你们都是炮灰", "永动型自走炮", "夜半屠猪男",
		"闷骚式自走炮", "不華麗的男人", "陈冠希的胶卷", "菊部有血", "小白样的大白", "冥想的印度人", "夜夜十几次", "做人狠低调", "芒果小慕斯",
		"抓住那条御姐", "幸福的回忆录", "单挑狂战士", "不放手的约定", "挪威的夏天", "终极版赛亚人", "牛肉面酸辣粉", "云之彼岸约定", "罗罗诺亚索隆",
		"村口的老大叔", "老衲法号叫船", "寂寞的尼古丁", "超级左手之神", "孙悟空的后代", "爱了就不伪装", "我是印度阿三", "农民工伤不起", "米老鼠唐老鸭",
		"我曾是一个神", "雨稀释了回忆", "错过一抹泪光", "专业电脑维修", "夫人不可以", "只为和平而战", "刺杀与烈火", "下一站守候", "爱借烟的男人",
		"为发型PK", "剥香蕉拉巴巴", "阴得一手好湿", "代表月亮砍你", "守护钉耙猫", "打趴凤姐", "春哥真男人", "伟大人生", "风花雪月", "冰河地狱",
		"地狱寒冰", "鸡肉嘎嘣脆", "六月飞霜", "似水似烟", "当里个党", "极速魅影", "极速魅影", "一刀一个", "吻着泪流", "妖姬", "粥粉面饭", "东邪西毒",
		"千本樱花", "一场幻觉", "暧昧宝贝", "浩空之月", "秋之枫韵", "月之传说", "秋月物语", "寂寞飞雨", "笑里藏刀", "清清君子", "你是个神经", "第一次上你",
		"股市炮灰", "行者无悔", "号码已换", "紫砂世界", "凛凛月光", "红酒醉了", "请喊我黄太太", "小蚂蚁背大象", "雪山流浪", "我没钱就变坏", "谁说你是垃圾",
		"爱丫头的男孩", "挖别人的鼻孔", "柒若只如当初", "好想娶个老婆", "向天堂的蝴蝶", "牛魔王的同胞", "酱爆触龙神", "红烧白猪王",
		"何谓生生世世", "凹凸曼凹凸慢", "就叫二狗好了", "杭州生活的人", "吃饱了还饿啊", "我要失恋了啊", "东北人的生活", "爱害羞的男生", "打抱不平而来",
		"我是飘着的云", "我就信春哥", "低调小屁股", "我想静静", "无边落寞", "风筝不想飞", "流氓满天飞", "不爽就打人", "上善若水",
		, "伪暴力分子", "裤宽三尺二", "石头剪刀布", "荒身心", "三千歌", "一笑醉", "空城绝唱", "沧桑一剑", "紫廖渔歌", "半瓶矿泉水", "暖风", "男人乖",
		"走遍四方", "男人不屑一顾", "我已无力说爱", "抽着寂寞的烟", "繁华沧桑", "卡尺", "往事随风", "剑胆琴心", "心如止水", "风伤依旧", "哥一直很低调",
		"遥忘而立", "忧郁的萨克斯", "哥比彩钻还炫", "烈日追风", "专属那女子", "独孤端夜", "慕容左铭", "司马玄翌", "sorry小电", "冰祭流光",
		"哥ヽ狠赞", "Kingヽ殿下", "倾城慕理", "子潇", "我帅故我拽", "戒情不戒烟", "再见丶单纯", "刺眼的温存", "逝去的往昔", "焚焰滔天", "龙武天", "韩式ヽ少帅",
		"红尘予依梦", "暧晗依依", "流星划无痕", "墨染江南", "流觞谨年", "缠绵的悲伤", "回忆全部没收", "摩登小男", "独特之蕞", "潇洒还击", "淡漠雨懵", "梦回西塘",
		"月如梭", "红尘辗", "孤帆远影", "烟波缥缈", "雨夜飘零", "花落叶相随", "奈何繁华落尽", "刻骨思念", "浮华童话", "尘埃落定", "年华交逝", "叶落吾心", "幻影逐风",
		"淡笔、青春", "怅然若失", "繁华如锦", "苍笙踏歌", "牵着灵魂漫步", "寂寞的救赎", "月下箫歌", "笑叹武陵衣马", "醉月南山", "写意河山", "自是湖海客", "剑惊风雨",
		"夏雨初晴", "栀璃鸢年", "夜的旋律", "寂若流年", "静听细水长流", "忆挽青笙尽", "暮色上浓妆", "月夜浅吟", "人比烟花寂寞", "弦已断", "墨城烟柳", "旧人殇",
		"琴断弦奈何", "花落相思起", "独﹄妩二", "陌上烟雨", "卖女孩的小火柴", "丑的拖网速", "偷心的贼", "鸡冻不如行动", "铁盗游击队", "致命隐匿", "情原谅我自负", "背后插人式", "阳光下的罪恶", "牛拦织女",
		"戳你的肺", "爱在戏院前", "老婆别罚我", "真心换黑心", "你给我过来", "愤怒的老鸟", "洞房不败", "你一溅我就笑", "咬字分开念", "缝小肛", "成吉思春", "神鲸大侠", "太平间公主",
		"骑驴玩漂移", "小六卖神剑", "朕日理万鸡", "老痰酸菜面", "见朕骑妓时刻", "智取其乳", "老衲让你受精",
		"钢管美臀", "精缸互撸娃", "善解人衣", "大精失射", "骚后更精彩", "承诺似雾如风",
		"西天取精", "予你挚终", "盲眼画师", "孤人情酒", "夜如笼", "淡忘。浅陌", "懒癌晚期",
		"步子大易扯蛋", "兽性打败理性", "负二代", "秂字拖", "那一夜", "哈里波特大", "拖拉机的惆怅", "娇腿绕腰肢",
		"杀驴般的叫声", "剪个蘑菇头", "不敢上厕所", "小雏菊、", "对猪乱弹琴", "躺着唱征菔", "尿尿逆流成河",
		"坐墙上等红杏", "扯淡还是扯蛋", "八戒的花衬衫", "爬墙、去约会", "纠结伦", "下辈子做猪", "化腐朽为绵掌",
		"野花压海棠", "街头捡破烂", "限量版男人", "帅得不够明显", "傻了吧唧", "不爱请靠边", "霸气范er", "童年时的裸奔",
		"爬墙头等红杏", "黄小瓜丶嘎嘎", "初吻给了烟", "八戒你又调皮", "二货少年", "情兽", "元芳看什么看", "三无先森",
		"半疯半颠", "忐忑妞", "我比窦娥还冤", "雷帝嘎嘎", "倒霉蛋", "骑蜗牛闯世界", "小丫么小二郎", "骚气外露丶",
		"治疗各种蛋疼", "帅得想自刎", "佬衲法呺嫖愙", "叼根香烟吻迩", "忘穿秋裤", "骑猪去兜风", "牙签翘起地球", "傻里傻气", "卖身不卖艺",
		"一袭白衣", "厌生′々", "枝上绵蛮", "回头已无路ゝ", "一曲断弦╮", "风劲角弓鸣", "追梦少年", "追光少女", "青梅佐以酒",
		"踽踽独行", "胭脂染了灰", "回眸泪倾↗城", "韵华镜中池", "蓦地一相逢", "墨城烟柳", "相约丶奈何桥", "笙歌醉梦间℃",
		"←琴默千弦︶", "无处寄笺", "是梦终会醒", "微凉·雅娅", "聚散如烟", "美貌征服祢娘", "帅炸宇宙", "我还爱你", "恶魔尊主",
		"帅死一条街", "至尊狂魔┈", "我这种无赖", "狂刄星空", "散场的拥抱", "九星剑临", "有你在就足够", "叶燃化诗", "王的梦",
		"嗜血超神", "向钱看向厚赚", "几分伤几分痴", "血幡海盗", "野战霸王", "朕太高冷", "邮递时光", "七年为一梦", "柠檬不萌i", "爱鉨已成瘾", "←龙霸天下`", "孤的王朝"
	];

	public testArr: string[] = [
	];



	/**
	 * 得到随机名字
	 * @param sex
	 * @return
	 *
	 */
	public getRandomName(sex: number): string {
		var realName: string = "无名氏";
		var firstNameRandom: number = Math.floor(Math.random() * 6) + 1;
		switch (firstNameRandom) {
			case 1:
				realName = this.getName2();
				break;
			default:
				realName = this.getName1();
				break;
		}
		if (realName.indexOf("null") > -1) {
			realName = realName.replace("null", "");
		}
		return realName;
	}

	public getName1() {
		let a1 = this.firstName;
		let a2 = this.secondName;
		let a3 = this.thirdName;

		return a1[Math.floor(Math.random() * a1.length)] + a2[Math.floor(Math.random() * a2.length)] + a3[Math.floor(Math.random() * a3.length)];
	}

	public getName2(): string {
		return this.specialNameArr[Math.floor(Math.random() * this.specialNameArr.length)];
	}

}
